In [2]:
import pandas as pd
import numpy as np

In [7]:
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])
print(A)
print()
print(B)
print()
print(A+B)
print(A.add(B, fill_value=0))

0    2
1    4
2    6
dtype: int64

1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64
0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [9]:
A =pd.DataFrame(np.random.randint(0,10,(2,2)),columns=list("AB"))
B =pd.DataFrame(np.random.randint(0,10,(3,3)),columns=list("BAC"))

print(A)
print()
print(B)

   A  B
0  0  9
1  9  6

   B  A  C
0  6  0  5
1  7  3  0
2  9  4  8

In [10]:
print(A+B)

      A     B   C
0   0.0  15.0 NaN
1  12.0  13.0 NaN
2   NaN   NaN NaN

In [11]:
A.add(B, fill_value=0)

      A     B    C
0   0.0  15.0  5.0
1  12.0  13.0  0.0
2   4.0   9.0  8.0

In [13]:
data = {
    'A': [i+5 for i in range(3)],
    'B': [i**2 for i in range(3)]
}
print(data)

{'A': [5, 6, 7], 'B': [0, 1, 4]}

In [15]:
df = pd.DataFrame(data)

In [16]:
df.A

0    5
1    6
2    7
Name: A, dtype: int64

In [17]:
df.A.sum()

18

In [18]:
df.sum()

A    18
B     5
dtype: int64

In [19]:
df.mean()

A    6.000000
B    1.666667
dtype: float64

In [22]:
df = pd.DataFrame({
    'col1':[2,1,4,6,7,10],
    'col2':['a','a','b',np.nan,'d','c'],
    'col3':[1,0,9,4,2,3]
})

df

   col1 col2  col3
0     2    a     1
1     1    a     0
2     4    b     9
3     6  NaN     4
4     7    d     2
5    10    c     3

In [23]:
df.sort_values('col1',ascending=False)

   col1 col2  col3
5    10    c     3
4     7    d     2
3     6  NaN     4
2     4    b     9
0     2    a     1
1     1    a     0

In [25]:
df.sort_values(['col1','col2'])

   col1 col2  col3
1     1    a     0
0     2    a     1
2     4    b     9
3     6  NaN     4
4     7    d     2
5    10    c     3

In [27]:
df = pd.DataFrame(np.random.rand(5,2),columns=["A","B"])
print(df)
df["A"]<0.5

          A         B
0  0.383760  0.968174
1  0.636382  0.106393
2  0.428430  0.461160
3  0.703621  0.853434
4  0.835532  0.325658

0     True
1    False
2     True
3    False
4    False
Name: A, dtype: bool

In [30]:
df[(df["A"]<0.5)&(df["B"]>0.3)]
df.query("A<0.5 and B>0.3")

         A         B
0  0.38376  0.968174
2  0.42843  0.461160

In [31]:
df = pd.DataFrame({
    'Animal':['dog','cat','cat','pig','cat'],
    'Name':['happy','sam','toby','mini','rocky']
})
df

  Animal   Name
0    dog  happy
1    cat    sam
2    cat   toby
3    pig   mini
4    cat  rocky

In [32]:
df["Animal"].str.contains("cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [34]:
df.Animal.str.match("cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [39]:
df[df["Animal"].str.contains("cat")]

  Animal   Name
1    cat    sam
2    cat   toby
4    cat  rocky

In [40]:
df[df.Animal.str.contains("cat")]

  Animal   Name
1    cat    sam
2    cat   toby
4    cat  rocky

In [42]:
#apply를 통해서 함수로 데이터를 다룰 수 있다
df = pd.DataFrame(np.arange(5),columns=["Num"])
def square(x):
    return x**2
a = df["Num"].apply(square)
b= df["Square"] = df.Num.apply(lambda x: x**2)

In [43]:
print(a)

0     0
1     1
2     4
3     9
4    16
Name: Num, dtype: int64

In [44]:
print(b)

0     0
1     1
2     4
3     9
4    16
Name: Num, dtype: int64

In [45]:
df = pd.DataFrame(columns=["phone"])
df.loc[0] = "010-1234-1235"
df.loc[1] = "공일공-일이삼사-1235"
df.loc[2] = "010.1234.일이삼오"
df.loc[3] = "공1공-1234.1이3오"
df["preprocess_phone"] = ''

In [46]:
df

           phone preprocess_phone
0  010-1234-1235
1  공일공-일이삼사-1235
2  010.1234.일이삼오
3  공1공-1234.1이3오

In [48]:
def get_preprocess_phone(phone):
    mapping_dict = {
    "공": "0",
    "일": "1",
    "이": "2",
    "삼": "3",
    "사": "4",
    "오": "5",
    "-": "",
    ".": "",
    }
    for k, v in mapping_dict.items():
        phone = phone.replace(k,v)
    return phone

In [49]:
df["preprocess_phone"] = df['phone'].apply(get_preprocess_phone)

In [50]:
df

           phone preprocess_phone
0  010-1234-1235      01012341235
1  공일공-일이삼사-1235      01012341235
2  010.1234.일이삼오      01012341235
3  공1공-1234.1이3오      01012341235

In [52]:
df = pd.DataFrame([0,0,1,1,0],columns =['sex'])
print(df,'\n')

   sex
0    0
1    0
2    1
3    1
4    0

In [53]:
df.sex.replace({0:'Male',1:'Female'})

0      Male
1      Male
2    Female
3    Female
4      Male
Name: sex, dtype: object

In [54]:
df

   sex
0    0
1    0
2    1
3    1
4    0

In [55]:
df.sex.replace({0:'male', 1:'female'}, inplace=True)
#inplace=True :바뀐 데이터타입이 바로 나옴

In [56]:
df

      sex
0    male
1    male
2  female
3  female
4    male

In [58]:
df = pd.DataFrame({'key':['A', 'B', 'C', 'A', 'B', 'C'],
                 'data':range(6)})
df.groupby('key')

In [59]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [63]:
df.groupby(['key', 'data']).sum()

Empty DataFrame
Columns: []
Index: [(A, 0), (A, 3), (B, 1), (B, 4), (C, 2), (C, 5)]

In [ ]:
#aggregate 집계

In [70]:
df.groupby('key').aggregate([min, np.median, max])

    data
     min median max
key
A      0    1.5   3
B      1    2.5   4
C      2    3.5   5

In [74]:
df.groupby('key').aggregate({min, np.sum})

    data
     sum min
key
A      3   0
B      5   1
C      7   2